-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1:3306
-- Thời gian đã tạo: Th6 11, 2023 lúc 09:24 AM
-- Phiên bản máy phục vụ: 10.4.28-MariaDB
-- Phiên bản PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `phongvan`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `image`
--

CREATE TABLE `image` (
  `id` int(11) NOT NULL,
  `route_id` int(11) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `image`
--

INSERT INTO `image` (`id`, `route_id`, `url`) VALUES
(1, 3, '1662960934_911401.jpg'),
(2, 3, '1662960934_spider-man-no-way-home-1920x1080_945945-mm-90.jpg');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `image_note`
--

CREATE TABLE `image_note` (
  `id` int(11) NOT NULL,
  `note_id` int(11) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `image_note`
--

INSERT INTO `image_note` (`id`, `note_id`, `url`) VALUES
(1, 1, '1686317790_WlLVf_8dbc879b1e54ff82db33df9b6c4bcedb.jpg');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `member`
--

CREATE TABLE `member` (
  `id` int(11) NOT NULL,
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT '',
  `email` varchar(255) DEFAULT '',
  `phone` varchar(20) DEFAULT '',
  `role` int(11) DEFAULT 0 COMMENT '0:Khách-1:Admin-2:Chi nhánh',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `member`
--

INSERT INTO `member` (`id`, `username`, `password`, `name`, `email`, `phone`, `role`, `created_at`) VALUES
(1, 'admin', 'c4ca4238a0b923820dcc509a6f75849b', 'Vương Văn Phong', 'phongvantiktok@gmail.com', '0862286865', 1, '2023-06-11 07:24:23'),
(6, 'phong', 'c4ca4238a0b923820dcc509a6f75849b', 'Phong Văn', 'phong@gmail.com', '0123456778', 0, '2023-06-10 01:52:39');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `note`
--

CREATE TABLE `note` (
  `id` int(11) NOT NULL,
  `content` varchar(5000) DEFAULT '',
  `note` varchar(5000) DEFAULT '',
  `author` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `note`
--

INSERT INTO `note` (`id`, `content`, `note`, `author`, `created_at`) VALUES
(1, '1', '1', 1, '2023-06-09 13:36:30'),
(2, 'sai kỹ thuật', 'sửa lại', 1, '2023-06-09 14:16:03'),
(3, 'sai kỹ thuật', 'sửa lại', 1, '2023-06-09 14:16:14'),
(4, 'sai kỹ thuật', 'sửa lại', 1, '2023-06-10 01:54:30');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `route`
--

CREATE TABLE `route` (
  `id` int(11) NOT NULL,
  `start` varchar(255) DEFAULT NULL,
  `end` varchar(255) DEFAULT NULL,
  `column` varchar(255) NOT NULL,
  `purpose` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `topographic` varchar(255) NOT NULL,
  `distance` int(11) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  `latitude` varchar(255) DEFAULT NULL,
  `note` mediumtext DEFAULT '',
  `author` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `route`
--

INSERT INTO `route` (`id`, `start`, `end`, `column`, `purpose`, `type`, `topographic`, `distance`, `longitude`, `latitude`, `note`, `author`, `created_at`) VALUES
(1, 'Hậu Lộc', 'Núi Hai', '1', 'Néo cuối', 'N121-38D', 'Đồi', 114, '105.7976357', '19.94999222', '', 1, '2023-06-09 07:37:12'),
(2, 'Hậu Lộc', 'Núi Ba', '2', 'Néo', 'N121-38D', 'Đồi', 564, '105.7980595', '19.94907953', '', 1, '2022-09-09 00:55:22'),
(3, 'Hậu Lộc', 'Núi Một', '3', 'Néo', 'N121-33C', 'Đồi', 307, '105.8024636', '19.94699443', '', 1, '2022-09-08 09:48:02'),
(4, 'Hậu Lộc', 'Núi Một', '4', 'Néo', 'N121-33C', 'Đồi', 270, '105.8058593', '19.94599851', '', 1, '2022-09-08 09:48:02'),
(5, 'Núi Hai', 'Núi Một', '5', 'Néo', 'N121-33C', 'Đồi', 295, '105.8085898', '19.94595313', '', 1, '2022-09-14 06:42:37'),
(6, 'Núi Hai', 'Núi Ba', '6', 'Néo', 'N121-29C', 'Đồi', 279, '105.8104244', '19.94410751', '', 1, '2022-09-14 07:08:46'),
(7, 'Hậu Lộc', 'Núi Một', '7', 'Néo', 'N121-33D', 'Đồi', 200, '105.8123717', '19.94237786', 'VT 01NR Cải tạo', 1, '2022-09-08 09:48:03'),
(8, 'Núi Ba', 'Núi Hai', '8', 'Néo', 'N121-38B', 'Đồi', 240, '105.8115215', '19.94022207', '', 1, '2022-09-14 07:08:55'),
(9, 'Hậu Lộc', 'Núi Một', '9', 'Néo', 'N121-38B', 'Đồi', 615, '105.8091048', '19.93520691', '', 1, '2022-09-08 09:48:03'),
(10, 'Hậu Lộc', 'Núi Một', '10', 'Néo', 'N121-29B', 'Đồi', 335, '105.8078334', '19.93229709', '', 1, '2022-09-08 09:48:03'),
(11, 'Hậu Lộc', 'Núi Một', '11', 'Néo', 'N121-33B', 'Đồi', 390, '105.8063797', '19.92913505', '', 1, '2022-09-08 09:48:03'),
(12, 'Hậu Lộc', 'Núi Một', '12', 'Néo góc', 'N121-38B', 'Ruộng', 565, '105.8043466', '19.92434901', '', 1, '2022-09-08 09:48:03'),
(13, 'Hậu Lộc', 'Núi Một', '13', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.8036653', '19.92284609', '', 1, '2022-09-08 09:48:03'),
(14, 'Hậu Lộc', 'Núi Một', '14', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.8027211', '19.92072786', '', 1, '2022-09-08 09:48:03'),
(15, 'Hậu Lộc', 'Núi Một', '15', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 210, '105.8019165', '19.91890717', '', 1, '2022-09-08 09:48:03'),
(16, 'Hậu Lộc', 'Núi Một', '16', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.8009992', '19.91681915', '', 1, '2022-09-08 09:48:03'),
(17, 'Hậu Lộc', 'Núi Một', '17', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 235, '105.8001301', '19.91480171', '', 1, '2022-09-08 09:48:03'),
(18, '123 Hậu Lộc', 'Núi Một', '18', 'Đỡ thẳng', 'Đ121-31C', 'Ruộng', 225, '105.7992986', '19.91291034', 'Không có', 1, '2023-06-09 13:58:33'),
(19, 'Hậu Lộc', 'Núi Một', '19', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7984672', '19.91106434', '', 1, '2022-09-08 09:48:03'),
(20, 'Hậu Lộc', 'Núi Một', '20', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 220, '105.7976571', '19.90917293', '', 1, '2022-09-08 09:48:03'),
(21, 'Hậu Lộc', 'Núi Một', '21', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7967184', '19.90715539', '', 1, '2022-09-08 09:48:03'),
(22, 'Hậu Lộc', 'Núi Một', '22', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7959405', '19.90526393', '', 1, '2022-09-08 09:48:03'),
(23, 'Hậu Lộc', 'Núi Một', '23', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7951359', '19.9033674', '', 1, '2022-09-08 09:48:03'),
(24, 'Hậu Lộc', 'Núi Một', '24', 'Néo', 'N121-29B', 'Ruộng', 220, '105.7943205', '19.90153137', '', 1, '2022-09-08 09:48:03'),
(25, 'Hậu Lộc', 'Núi Một', '25', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.7942132', '19.89933215', '', 1, '2022-09-08 09:48:03'),
(26, 'Hậu Lộc', 'Núi Một', '26', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 220, '105.7941059', '19.8973044', '', 1, '2022-09-08 09:48:03'),
(27, 'Hậu Lộc', 'Núi Một', '27', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.793961', '19.89488318', '', 1, '2022-09-08 09:48:03'),
(28, 'Hậu Lộc', 'Núi Một', '28', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7938806', '19.89303697', '', 1, '2022-09-08 09:48:03'),
(29, 'Hậu Lộc', 'Núi Một', '29', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.793784', '19.89088807', '', 1, '2022-09-08 09:48:03'),
(30, 'Hậu Lộc', 'Núi Một', '30', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7936553', '19.88895606', '', 1, '2022-09-08 09:48:03'),
(31, 'Hậu Lộc', 'Núi Một', '31', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7935802', '19.8868626', '', 1, '2022-09-08 09:48:03'),
(32, 'Hậu Lộc', 'Núi Một', '32', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7937411', '19.88478424', '', 1, '2022-09-08 09:48:03'),
(33, 'Hậu Lộc', 'Núi Một', '33', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7939342', '19.88246372', '', 1, '2022-09-08 09:48:03'),
(34, 'Hậu Lộc', 'Núi Một', '34', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7941166', '19.88006749', '', 1, '2022-09-08 09:48:03'),
(35, 'Hậu Lộc', 'Núi Một', '35', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.794299', '19.877646', '', 1, '2022-09-08 09:48:03'),
(36, 'Hậu Lộc', 'Núi Một', '36', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 245, '105.7944921', '19.87518916', '', 1, '2022-09-08 09:48:04'),
(37, 'Hậu Lộc', 'Núi Một', '37', 'Néo', 'N121-29B', 'Ruộng', 217, '105.7947121', '19.87243462', '', 1, '2022-09-08 09:48:04'),
(38, 'Hậu Lộc', 'Núi Một', '38', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.7954003', '19.86915885', '', 1, '2022-09-08 09:48:04'),
(39, 'Hậu Lộc', 'Núi Một', '39', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 213, '105.7962586', '19.86590978', '', 1, '2022-09-08 09:48:04'),
(40, 'Hậu Lộc', 'Núi Một', '40', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7963874', '19.86451478', '', 1, '2022-09-08 09:48:04'),
(41, 'Hậu Lộc', 'Núi Một', '41', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7967334', '19.86257993', '', 1, '2022-09-08 09:48:04'),
(42, 'Hậu Lộc', 'Núi Một', '42', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7970311', '19.86137157', '', 1, '2022-09-08 09:48:04'),
(43, 'Hậu Lộc', 'Núi Một', '43', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7973315', '19.85987563', '', 1, '2022-09-08 09:48:04'),
(44, 'Hậu Lộc', 'Núi Một', '44', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7975032', '19.8584276', '', 1, '2022-09-08 09:48:04'),
(45, 'Hậu Lộc', 'Núi Một', '45', 'Néo', 'N121-38B', 'Đồi', 330, '105.7978009', '19.8572949', '', 1, '2022-09-08 09:48:04'),
(46, 'Hậu Lộc', 'Núi Một', '46', 'Néo', 'N121-38C', 'Đồi', 290, '105.7977365', '19.85396486', '', 1, '2022-09-08 09:48:04'),
(47, 'Hậu Lộc', 'Núi Một', '47', 'Néo', 'N121-38B', 'Đồi', 314, '105.7973905', '19.85171704', '', 1, '2022-09-08 09:48:04'),
(48, 'Hậu Lộc', 'Núi Một', '48', 'Néo góc', 'N121-38D', 'Ruộng', 222, '105.7970847', '19.84974671', 'Đấu nối NRE9.14', 1, '2022-09-08 09:48:04'),
(49, 'Hậu Lộc', 'Núi Một', '49', 'Néo vượt', 'N121-33D', 'Đồi', 322, '105.7959716', '19.84810937', '', 1, '2022-09-08 09:48:04'),
(50, 'Hậu Lộc', 'Núi Một', '50', 'Đỡ thẳng', 'ĐV122-63/48', 'Đồi', 689, '105.7920234', '19.84717843', '', 1, '2022-09-08 09:48:04'),
(51, 'Hậu Lộc', 'Núi Một', '51', 'Néo vượt', 'N121-29D', 'Đồi', 402, '105.7861225', '19.8454351', '', 1, '2022-09-08 09:48:04'),
(52, 'Hậu Lộc', 'Núi Một', '52', 'Néo góc', 'N121-33C', 'Ruộng', 225, '105.7831775', '19.84491538', '', 1, '2022-09-08 09:48:04'),
(53, 'Hậu Lộc', 'Núi Một', '53', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.780514', '19.84556882', '', 1, '2022-09-08 09:48:04'),
(54, 'Hậu Lộc', 'Núi Một', '54', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 210, '105.7783173', '19.84626514', '', 1, '2022-09-08 09:48:04'),
(55, 'Hậu Lộc', 'Núi Một', '55', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 240, '105.7760508', '19.84677729', '', 1, '2022-09-08 09:48:04'),
(56, 'Hậu Lộc', 'Núi Một', '56', 'Néo', 'N121-29C', 'Ruộng', 235, '105.7729663', '19.8477486', '', 1, '2022-09-08 09:48:04'),
(57, 'Hậu Lộc', 'Núi Một', '57', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 215, '105.7718693', '19.84654266', '', 1, '2022-09-08 09:48:04'),
(58, 'Hậu Lộc', 'Núi Một', '58', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 230, '105.7706596', '19.84520047', '', 1, '2022-09-08 09:48:04'),
(59, 'Hậu Lộc', 'Núi Một', '59', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 220, '105.7693131', '19.84372456', '', 1, '2022-09-08 09:48:04'),
(60, 'Hậu Lộc', 'Núi Một', '60', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 215, '105.7678004', '19.84204931', '', 1, '2022-09-08 09:48:04'),
(61, 'Hậu Lộc', 'Núi Một', '61', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 200, '105.7665719', '19.8406869', '', 1, '2022-09-08 09:48:05'),
(62, 'Hậu Lộc', 'Núi Một', '62', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7653649', '19.83935728', '', 1, '2022-09-08 09:48:05'),
(63, 'Hậu Lộc', 'Núi Một', '63', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7639621', '19.83780814', '', 1, '2022-09-08 09:48:05'),
(64, 'Hậu Lộc', 'Núi Một', '64', 'Néo thẳng', 'N121-38D', 'Ruộng', 235, '105.7626485', '19.83635297', 'Cải tạo nâng cấp đường Tránh (A.Nam làm)', 1, '2022-09-08 09:48:05'),
(65, 'Hậu Lộc', 'Núi Một', '65', 'Néo thẳng', 'N121-38D', 'Ruộng', 225, '105.7613114', '19.83488076', '', 1, '2022-09-08 09:48:05'),
(66, 'Hậu Lộc', 'Núi Một', '66', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7599502', '19.83337321', '', 1, '2022-09-08 09:48:05'),
(67, 'Hậu Lộc', 'Núi Một', '67', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7586493', '19.83193755', '', 1, '2022-09-08 09:48:05'),
(68, 'Hậu Lộc', 'Núi Một', '68', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7573646', '19.83051702', '', 1, '2022-09-08 09:48:05'),
(69, 'Hậu Lộc', 'Núi Một', '69', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7562206', '19.82925418', '', 1, '2022-09-08 09:48:05'),
(70, 'Hậu Lộc', 'Núi Một', '70', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 210, '105.7552121', '19.82813893', '', 1, '2022-09-08 09:48:05'),
(71, 'Hậu Lộc', 'Núi Một', '71', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 205, '105.7539622', '19.82675748', '', 1, '2022-09-08 09:48:05'),
(72, 'Hậu Lộc', 'Núi Một', '72', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 160, '105.7524601', '19.82510098', '', 1, '2022-09-08 09:48:05'),
(73, 'Hậu Lộc', 'Núi Một', '73', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 197, '105.7509273', '19.82340409', '', 1, '2022-09-08 09:48:05'),
(74, 'Hậu Lộc', 'Núi Một', '74', 'Néo', 'N121-29B', 'Ruộng', 240, '105.7495714', '19.82191157', '', 1, '2022-09-08 09:48:05'),
(75, 'Hậu Lộc', 'Núi Một', '75', 'Đỡ thẳng', 'Đ121-27B', 'Đồi', 202, '105.7490591', '19.8193277', '', 1, '2022-09-08 09:48:05'),
(76, 'Hậu Lộc', 'Núi Một', '76', 'Néo cuối', 'N121-29C', 'Đồi', 20, '105.7484596', '19.81670593', '', 1, '2022-09-08 09:48:05'),
(77, 'Quảng Sương', 'Tỉnh Gia', '1', 'Néo cuối', 'N121-33D', 'Đồi', 114, '105.7976357', '19.94999222', '', 1, '2022-09-08 09:48:05'),
(78, 'Quảng Sương', 'Tỉnh Gia', '2', 'Néo', 'N121-38D', 'Đồi', 564, '105.7980595', '19.94907953', '', 1, '2022-09-08 09:48:05'),
(79, 'Quảng Sương', 'Tỉnh Gia', '3', 'Néo', 'N121-33C', 'Đồi', 307, '105.8024636', '19.94699443', '', 1, '2022-09-08 09:48:05'),
(80, 'Quảng Sương', 'Tỉnh Gia', '4', 'Néo', 'N121-33C', 'Đồi', 270, '105.8058593', '19.94599851', '', 1, '2022-09-08 09:48:05'),
(81, 'Quảng Sương', 'Tỉnh Gia', '5', 'Néo', 'N121-33C', 'Đồi', 295, '105.8085898', '19.94595313', '', 1, '2022-09-08 09:48:05'),
(82, 'Quảng Sương', 'Tỉnh Gia', '6', 'Néo', 'N121-29C', 'Đồi', 279, '105.8104244', '19.94410751', '', 1, '2022-09-08 09:48:05'),
(83, 'Quảng Sương', 'Tỉnh Gia', '7', 'Néo', 'N121-33D', 'Đồi', 200, '105.8123717', '19.94237786', 'VT 01NR Cải tạo', 1, '2022-09-08 09:48:05'),
(84, 'Quảng Sương', 'Tỉnh Gia', '8', 'Néo', 'N121-38B', 'Đồi', 240, '105.8115215', '19.94022207', '', 1, '2022-09-08 09:48:05'),
(85, 'Quảng Sương', 'Tỉnh Gia', '9', 'Néo', 'N121-38B', 'Đồi', 615, '105.8091048', '19.93520691', '', 1, '2022-09-08 09:48:06'),
(86, 'Quảng Sương', 'Tỉnh Gia', '10', 'Néo', 'N121-29B', 'Đồi', 335, '105.8078334', '19.93229709', '', 1, '2022-09-08 09:48:06'),
(87, 'Quảng Sương', 'Tỉnh Gia', '11', 'Néo', 'N121-33B', 'Đồi', 390, '105.8063797', '19.92913505', '', 1, '2022-09-08 09:48:06'),
(88, 'Quảng Sương', 'Tỉnh Gia', '12', 'Néo góc', 'N121-38B', 'Ruộng', 565, '105.8043466', '19.92434901', '', 1, '2022-09-08 09:48:06'),
(89, 'Quảng Sương', 'Tỉnh Gia', '13', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.8036653', '19.92284609', '', 1, '2022-09-08 09:48:06'),
(90, 'Quảng Sương', 'Tỉnh Gia', '14', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.8027211', '19.92072786', '', 1, '2022-09-08 09:48:06'),
(91, 'Quảng Sương', 'Tỉnh Gia', '15', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 210, '105.8019165', '19.91890717', '', 1, '2022-09-08 09:48:06'),
(92, 'Quảng Sương', 'Tỉnh Gia', '16', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.8009992', '19.91681915', '', 1, '2022-09-08 09:48:06'),
(93, 'Quảng Sương', 'Tỉnh Gia', '17', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 235, '105.8001301', '19.91480171', '', 1, '2022-09-08 09:48:06'),
(94, 'Quảng Sương', 'Tỉnh Gia', '18', 'Đỡ thẳng', 'Đ121-31C', 'Ruộng', 225, '105.7992986', '19.91291034', '', 1, '2022-09-08 09:48:06'),
(95, 'Quảng Sương', 'Tỉnh Gia', '19', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7984672', '19.91106434', '', 1, '2022-09-08 09:48:06'),
(96, 'Quảng Sương', 'Tỉnh Gia', '20', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 220, '105.7976571', '19.90917293', '', 1, '2022-09-08 09:48:06'),
(97, 'Quảng Sương', 'Tỉnh Gia', '21', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7967184', '19.90715539', '', 1, '2022-09-08 09:48:06'),
(98, 'Quảng Sương', 'Tỉnh Gia', '22', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7959405', '19.90526393', '', 1, '2022-09-08 09:48:06'),
(99, 'Quảng Sương', 'Tỉnh Gia', '23', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7951359', '19.9033674', '', 1, '2022-09-08 09:48:06'),
(100, 'Quảng Sương', 'Tỉnh Gia', '24', 'Néo', 'N121-29B', 'Ruộng', 220, '105.7943205', '19.90153137', '', 1, '2022-09-08 09:48:06'),
(101, 'Quảng Sương', 'Tỉnh Gia', '25', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.7942132', '19.89933215', '', 1, '2022-09-08 09:48:06'),
(102, 'Quảng Sương', 'Tỉnh Gia', '26', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 220, '105.7941059', '19.8973044', '', 1, '2022-09-08 09:48:06'),
(103, 'Quảng Sương', 'Tỉnh Gia', '27', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.793961', '19.89488318', '', 1, '2022-09-08 09:48:06'),
(104, 'Quảng Sương', 'Tỉnh Gia', '28', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7938806', '19.89303697', '', 1, '2022-09-08 09:48:06'),
(105, 'Quảng Sương', 'Tỉnh Gia', '29', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.793784', '19.89088807', '', 1, '2022-09-08 09:48:06'),
(106, 'Quảng Sương', 'Tỉnh Gia', '30', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7936553', '19.88895606', '', 1, '2022-09-08 09:48:06'),
(107, 'Quảng Sương', 'Tỉnh Gia', '31', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7935802', '19.8868626', '', 1, '2022-09-08 09:48:06'),
(108, 'Quảng Sương', 'Tỉnh Gia', '32', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7937411', '19.88478424', '', 1, '2022-09-08 09:48:06'),
(109, 'Quảng Sương', 'Tỉnh Gia', '33', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7939342', '19.88246372', '', 1, '2022-09-08 09:48:06'),
(110, 'Quảng Sương', 'Tỉnh Gia', '34', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.7941166', '19.88006749', '', 1, '2022-09-08 09:48:06'),
(111, 'Quảng Sương', 'Tỉnh Gia', '35', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 240, '105.794299', '19.877646', '', 1, '2022-09-08 09:48:06'),
(112, 'Quảng Sương', 'Tỉnh Gia', '36', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 245, '105.7944921', '19.87518916', '', 1, '2022-09-08 09:48:06'),
(113, 'Quảng Sương', 'Tỉnh Gia', '37', 'Néo', 'N121-29B', 'Ruộng', 217, '105.7947121', '19.87243462', '', 1, '2022-09-08 09:48:06'),
(114, 'Quảng Sương', 'Tỉnh Gia', '38', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 250, '105.7954003', '19.86915885', '', 1, '2022-09-08 09:48:07'),
(115, 'Quảng Sương', 'Tỉnh Gia', '39', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 213, '105.7962586', '19.86590978', '', 1, '2022-09-08 09:48:07'),
(116, 'Quảng Sương', 'Tỉnh Gia', '40', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7963874', '19.86451478', '', 1, '2022-09-08 09:48:07'),
(117, 'Quảng Sương', 'Tỉnh Gia', '41', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7967334', '19.86257993', '', 1, '2022-09-08 09:48:07'),
(118, 'Quảng Sương', 'Tỉnh Gia', '42', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7970311', '19.86137157', '', 1, '2022-09-08 09:48:07'),
(119, 'Quảng Sương', 'Tỉnh Gia', '43', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7973315', '19.85987563', '', 1, '2022-09-08 09:48:07'),
(120, 'Quảng Sương', 'Tỉnh Gia', '44', 'Đỡ thẳng', 'Đ121-27C', 'Ruộng', 230, '105.7975032', '19.8584276', '', 1, '2022-09-08 09:48:07'),
(121, 'Quảng Sương', 'Tỉnh Gia', '45', 'Néo', 'N121-38B', 'Đồi', 330, '105.7978009', '19.8572949', '', 1, '2022-09-08 09:48:07'),
(122, 'Quảng Sương', 'Tỉnh Gia', '46', 'Néo', 'N121-38C', 'Đồi', 290, '105.7977365', '19.85396486', '', 1, '2022-09-08 09:48:07'),
(123, 'Quảng Sương', 'Tỉnh Gia', '47', 'Néo', 'N121-38B', 'Đồi', 314, '105.7973905', '19.85171704', '', 1, '2022-09-08 09:48:07'),
(124, 'Quảng Sương', 'Tỉnh Gia', '48', 'Néo góc', 'N121-38D', 'Ruộng', 222, '105.7970847', '19.84974671', 'Đấu nối NRE9.14', 1, '2022-09-08 09:48:07'),
(125, 'Quảng Sương', 'Tỉnh Gia', '49', 'Néo vượt', 'N121-33D', 'Đồi', 322, '105.7959716', '19.84810937', '', 1, '2022-09-08 09:48:07'),
(126, 'Quảng Sương', 'Tỉnh Gia', '50', 'Đỡ thẳng', 'ĐV122-63/48', 'Đồi', 689, '105.7920234', '19.84717843', '', 1, '2022-09-08 09:48:07'),
(127, 'Quảng Sương', 'Tỉnh Gia', '51', 'Néo vượt', 'N121-29D', 'Đồi', 402, '105.7861225', '19.8454351', '', 1, '2022-09-08 09:48:07'),
(128, 'Quảng Sương', 'Tỉnh Gia', '52', 'Néo góc', 'N121-33C', 'Ruộng', 225, '105.7831775', '19.84491538', '', 1, '2022-09-08 09:48:07'),
(129, 'Quảng Sương', 'Tỉnh Gia', '53', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.780514', '19.84556882', '', 1, '2022-09-08 09:48:07'),
(130, 'Quảng Sương', 'Tỉnh Gia', '54', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 210, '105.7783173', '19.84626514', '', 1, '2022-09-08 09:48:07'),
(131, 'Quảng Sương', 'Tỉnh Gia', '55', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 240, '105.7760508', '19.84677729', '', 1, '2022-09-08 09:48:07'),
(132, 'Quảng Sương', 'Tỉnh Gia', '56', 'Néo', 'N121-29C', 'Ruộng', 235, '105.7729663', '19.8477486', '', 1, '2022-09-08 09:48:07'),
(133, 'Quảng Sương', 'Tỉnh Gia', '57', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 215, '105.7718693', '19.84654266', '', 1, '2022-09-08 09:48:07'),
(134, 'Quảng Sương', 'Tỉnh Gia', '58', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 230, '105.7706596', '19.84520047', '', 1, '2022-09-08 09:48:07'),
(135, 'Quảng Sương', 'Tỉnh Gia', '59', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 220, '105.7693131', '19.84372456', '', 1, '2022-09-08 09:48:07'),
(136, 'Quảng Sương', 'Tỉnh Gia', '60', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 215, '105.7678004', '19.84204931', '', 1, '2022-09-08 09:48:07'),
(137, 'Quảng Sương', 'Tỉnh Gia', '61', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 200, '105.7665719', '19.8406869', '', 1, '2022-09-08 09:48:08'),
(138, 'Quảng Sương', 'Tỉnh Gia', '62', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7653649', '19.83935728', '', 1, '2022-09-08 09:48:08'),
(139, 'Quảng Sương', 'Tỉnh Gia', '63', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7639621', '19.83780814', '', 1, '2022-09-08 09:48:08'),
(140, 'Quảng Sương', 'Tỉnh Gia', '64', 'Néo thẳng', 'N121-38D', 'Ruộng', 235, '105.7626485', '19.83635297', 'Cải tạo nâng cấp đường Tránh (A.Nam làm)', 1, '2022-09-08 09:48:08'),
(141, 'Quảng Sương', 'Tỉnh Gia', '65', 'Néo thẳng', 'N121-38D', 'Ruộng', 225, '105.7613114', '19.83488076', '', 1, '2022-09-08 09:48:08'),
(142, 'Quảng Sương', 'Tỉnh Gia', '66', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7599502', '19.83337321', '', 1, '2022-09-08 09:48:08'),
(143, 'Quảng Sương', 'Tỉnh Gia', '67', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7586493', '19.83193755', '', 1, '2022-09-08 09:48:08'),
(144, 'Quảng Sương', 'Tỉnh Gia', '68', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7573646', '19.83051702', '', 1, '2022-09-08 09:48:08'),
(145, 'Quảng Sương', 'Tỉnh Gia', '69', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 225, '105.7562206', '19.82925418', '', 1, '2022-09-08 09:48:08'),
(146, 'Quảng Sương', 'Tỉnh Gia', '70', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 210, '105.7552121', '19.82813893', '', 1, '2022-09-08 09:48:08'),
(147, 'Quảng Sương', 'Tỉnh Gia', '71', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 205, '105.7539622', '19.82675748', '', 1, '2022-09-08 09:48:08'),
(148, 'Quảng Sương', 'Tỉnh Gia', '72', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 160, '105.7524601', '19.82510098', '', 1, '2022-09-08 09:48:08'),
(149, 'Quảng Sương', 'Tỉnh Gia', '73', 'Đỡ thẳng', 'Đ121-27B', 'Ruộng', 197, '105.7509273', '19.82340409', '', 1, '2022-09-08 09:48:08'),
(150, 'Quảng Sương', 'Tỉnh Gia', '74', 'Néo', 'N121-29B', 'Ruộng', 240, '105.7495714', '19.82191157', '', 1, '2022-09-08 09:48:08'),
(151, 'Quảng Sương', 'Tỉnh Gia', '75', 'Đỡ thẳng', 'Đ121-27B', 'Đồi', 202, '105.7490591', '19.8193277', '', 1, '2022-09-08 09:48:08'),
(152, 'Quảng Sương', 'Tỉnh Gia', '76', 'Néo cuối', 'N121-29C', 'Đồi', 20, '105.7484596', '19.81670593', '', 1, '2022-09-08 09:48:08'),
(153, 'Quảng Sương', 'Tỉnh Gia', '77-a', 'Néo cuối', 'N121-29C', 'Đồi', 20, '105.7484596', '19.81670593', '', 1, '2022-09-08 09:48:08'),
(154, 'Quảng Sương', 'Tỉnh Gia', '77-b', 'Néo cuối', 'N121-29C', 'Đồi', 20, '105.7484596', '19.81670593', '', 1, '2022-09-08 09:48:08'),
(155, 'Hậu Lộc', 'Núi Một', '222', 'Néo', 'F3erd4', 'Đồi', 224, '105.7976357', '19.94999222', 'không', 1, '2023-06-09 07:39:11'),
(156, 'Hậu Lộc', 'Núi Một', '100', 'Néo', 'N121-33C', 'Đồi', 114, '19.94599851', '1.084802', '', 1, '2023-06-09 13:46:49'),
(157, 'Hà Nội', 'Núi Một', '100', 'Néo cuối', 'N121-33C', 'Đồi', 200, '105.8085898', '19.94595313', 'Không có', 1, '2023-06-09 13:57:24');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `station`
--

CREATE TABLE `station` (
  `id` int(11) NOT NULL,
  `start` varchar(255) DEFAULT '',
  `end` varchar(255) DEFAULT '',
  `route` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `station`
--

INSERT INTO `station` (`id`, `start`, `end`, `route`) VALUES
(1, '110kV Hậu Lộc', '110kV Núi Một', 'Hậu Lộc - Núi Một'),
(2, '110kV Quảng Sương', '110kV Tỉnh Gia', 'Quảng Sương - Tỉnh Gia'),
(3, '110kV Hậu Lộc', '110kV Núi Ba', 'Hậu Lộc - Núi Ba'),
(4, '110kV Hậu Lộc', '110kV Núi Hai', 'Hậu Lộc - Núi Hai'),
(5, '123 HL', 'Nuis 1', '123 Hậu Lộc - Núi Một');

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `image`
--
ALTER TABLE `image`
  ADD PRIMARY KEY (`id`),
  ADD KEY `route_id` (`route_id`);

--
-- Chỉ mục cho bảng `image_note`
--
ALTER TABLE `image_note`
  ADD PRIMARY KEY (`id`),
  ADD KEY `note_id` (`note_id`);

--
-- Chỉ mục cho bảng `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `note`
--
ALTER TABLE `note`
  ADD PRIMARY KEY (`id`),
  ADD KEY `author` (`author`);

--
-- Chỉ mục cho bảng `route`
--
ALTER TABLE `route`
  ADD PRIMARY KEY (`id`),
  ADD KEY `author` (`author`);

--
-- Chỉ mục cho bảng `station`
--
ALTER TABLE `station`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `image`
--
ALTER TABLE `image`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT cho bảng `image_note`
--
ALTER TABLE `image_note`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT cho bảng `member`
--
ALTER TABLE `member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT cho bảng `note`
--
ALTER TABLE `note`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT cho bảng `route`
--
ALTER TABLE `route`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=158;

--
-- AUTO_INCREMENT cho bảng `station`
--
ALTER TABLE `station`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `image`
--
ALTER TABLE `image`
  ADD CONSTRAINT `image_ibfk_1` FOREIGN KEY (`route_id`) REFERENCES `route` (`id`);

--
-- Các ràng buộc cho bảng `image_note`
--
ALTER TABLE `image_note`
  ADD CONSTRAINT `image_note_ibfk_1` FOREIGN KEY (`note_id`) REFERENCES `note` (`id`);

--
-- Các ràng buộc cho bảng `note`
--
ALTER TABLE `note`
  ADD CONSTRAINT `note_ibfk_1` FOREIGN KEY (`author`) REFERENCES `member` (`id`);

--
-- Các ràng buộc cho bảng `route`
--
ALTER TABLE `route`
  ADD CONSTRAINT `route_ibfk_1` FOREIGN KEY (`author`) REFERENCES `member` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
